[{
  "_id": {
    "$oid": "66801ffab1af5b73e43d37ce"
  },
  "type": "plain_text",
  "content": " 1 The followining information pertains specifically to Discovery Bank Gold account  The Discovery Bank  Gold Card Account  Qualifying income from R100,000 to R350,000 a year  R100 per month  Everyday banking with fantastic rewards     If you're looking for an account that's flexible, affordable and gives you more than just a  credit card, then the Discovery Bank Gold Card Account is the smart choice for you.  Plus, you can unlock fantastic value and rewards with your good banking behaviour.  Why are we calling it more than just a credit card? Because you get a credit card with full  transactional capabilities including the ability to set up third-party debit orders, make  digital payments and accept salary deposits. You get up to 55 days' interest-free credit  on select transactions, and you can manage your credit easily with the most flexible  credit facility in the market. Plus, you can add as many free savings accounts as you  need to achieve your goals. And you also get access to the only Real-Time Forex  Accounts, available 24/7 on your banking app.  Engage with our Vitality Money programme and unlock your personalised shared-value  stack of lifestyle and travel rewards. You can get up to 40% back on HealthyFood and  save up to 10% on fuel and Uber rides.  And that's only the beginning.  Get the account that rewards you for getting financially fit  Discovery Bank rewards clients with Discovery Miles for getting healthier, driving well  and spending responsibly. Discovery Miles is Discovery's rewards currency that's more  versatile - and more valuable - than cash, with more ways to earn and spend them than  ever before.  With a Discovery Bank Gold Card Account you can earn the following rewards in  Discovery Miles:  Up to   40%  back on healthy groceries at Pick n Pay or Woolworths with HealthyFood                  Up to   10%  back on fuel purchases at bp and select Shell service stations, and up to 10% back on  Uber rides                 Up to   2.5%  back on Bank-Integrated Discovery Life plan premiums             You'll receive 10 Discovery Miles for every R1 reward you earn back.  Earn base Discovery Miles on all qualifying credit card and multicurrency debit card  purchases as you spend throughout the month. Plus, earn higher base Discovery Miles  when you use a virtual card, depending on your Vitality Money status.  Earn thousands of Discovery Miles every week on the new,  personalised gameboard with Vitality Active Rewards  Your goals  Achieve your weekly Spend, Exercise or Drive goal to unlock Activity tiles of up to Ð1,000    Your products  Unlock the Discovery tile of up to Ð750 based on how many Discovery products you  have    Your spend  Spend at our grocery, pharmacy and fuel partners to unlock the Partner Spend tiles of  up to Ð1,000 for the chance to earn your largest weekly transactions back  "
},
{
  "_id": {
    "$oid": "66802215b1af5b73e43d37d0"
  },
  "type": "plain_text",
  "content": " 3 Demand Savings Account  The next part of information pertains to the Demand Savings Account  Interest rates  • Earn up to 7.25% interest on your savings with Dynamic Interest Rates  • With Vitality Money, earn a Dynamic Interest Rate boost by banking healthier.  Terms and conditions apply.  • Read more about interest rates for our products.  What you get  • No minimum amount required  • Control how often and how much you save  Fees and charges  • No monthly fee  • Pay for your day-to-day transactions. View our fees guide.  What can you do  • Transfer money between linked accounts  • Pay your beneficiaries and contacts on your phone using Discovery Pay  Immediate access to your money  Control how often and how much you want to save  Save for events, special purchases and emergencies. This is the most popular savings  account.     Tax-Free Demand Savings Account  The next bit of information pertains to the Tax-Free Demand Savings Account  Take advantage of your annual tax-free investment allowance  Immediate access to your money  Save for long term goals, like retirement  Interest rates  • Earn 8% interest on your savings  What you get  • Earn interest on your savings, tax-free  • Save from R1 000, up to your annual limit  • Control how often you add to your savings  Fees and charges  • No monthly fee  • Pay for your day-to-day transactions. View our fees guide.    What can you do  • Start saving from any amount    Fixed Deposit Account  The following information pertains to the Fixed Deposit Account  • Up to 11.31% interest  • Earn on your savings at market-leading interest rates  • Invest a lump sum upfront  • Earn higher interest on your savings over a fixed period  Interest rates  • Earn up to 11.31% (period effective) interest paid at maturity by reinvesting your  monthly interest  • Earn up to 9% interest paid to you every month  • Earn up to 8.53% (period effective) interest paid upfront  • Learn more on our Fixed Deposit Account interest rates  What you get  • Save a lump sum upfront and earn interest monthly  • Decide how your interest is paid, and whether you re-invest it  • Negotiate a personalised interest rate for large deposits  Fees and charges  • No monthly fee  • Pay for your day-to-day transactions. View our fees guide.  • Withdrawals from your account before your investment term ends can result in a  penalty fee.  What can you do  • Minimum balance of R10 000  • Choose your investment term, from 3 to 60 months    This is general information that applies to all savings accounts and does not pertain to  one specific account only but all of them:  We quote your interest at nominal annual compounded monthly (NACM) and period effective rates. All interest  rates and fees are as at the publication date.  Remember that our savings accounts don't come with bank cards. You can get physical and virtual bank cards  when you open a transaction or credit card account   "
},
{
  "_id": {
    "$oid": "6685a8dbb1af5b73e43d37dd"
  },
  "type": "plain_text",
  "content": " The Discovery Bank Black Card Account Qualifying income from R850,000 to R2.5 million a year R235 per month Superior banking wherever you go   If you're looking for more than just a credit card, the Discovery Bank Black Card Account was designed for you. Enjoy exceptional banking wherever you go in the world - with personalised features, exclusive travel and other benefits, and world-class service. Your enhanced credit card has full transactional capabilities including the ability to set up third-party debit orders, make digital payments and accept salary deposits. Get up to 55 days' interest-free credit on select transactions, and manage your credit easily with the most flexible credit facility in the market. You also get access to the only Real-Time Forex Accounts, available 24/7 on your banking app. Engage with our Vitality Money programme and unlock your personalised shared-value stack of lifestyle and travel rewards. You can get incredible local and international flight savings and get faster security clearance at OR Tambo and Cape Town International Airports. Plus you can relax in style with access to The Lounge in South Africa and over 1,200 airport lounges worldwide. And that's only the beginning. Get the account that rewards you for getting financially fit Discovery Bank rewards clients with Discovery Miles for getting healthier, driving well and spending responsibly. Discovery Miles is Discovery's rewards currency that's more versatile - and more valuable - than cash, with more ways to earn and spend them than ever before. With a Discovery Bank Black Card Account you can earn the following rewards in Discovery Miles: Up to   50% back on healthy groceries at Pick n Pay or Woolworths with HealthyFood   Up to   50% back on personal care items at Clicks or Dis-Chem with HealthyCare, and on baby essentials at Babies R Us, Toys R Us or Dis-Chem Baby City with HealthyBaby Up to   15% back on fuel purchases at bp and select Shell service stations, and up to 15% back on Uber rides   Up to   5% back on Bank-Integrated Discovery Life plan premiums   You'll receive 10 Discovery Miles for every R1 reward you earn back. Earn base Discovery Miles on all qualifying credit card and multicurrency debit card purchases as you spend throughout the month. Plus, earn higher base Discovery Miles when you use a virtual card, depending on your Vitality Money status. Earn thousands of Discovery Miles every week on the new, personalised gameboard with Vitality Active Rewards Your goals Achieve your weekly Spend, Exercise or Drive goal to unlock Activity tiles of up to Ð1,000 Your products Unlock the Discovery tile of up to Ð750 based on how many Discovery products you have Your spend Spend at our grocery, pharmacy and fuel partners to unlock the Partner Spend tiles of up to Ð1,000 for the chance to earn your largest weekly transactions back Get up to 30% off when you spend your Discovery Miles: With a Discovery Bank Black Card Account, you could get up to 15% off when you spend your Discovery Miles throughout the month: Up to 15% off when you shop with your Discovery Miles at over 40 great online and in-store retail partners. Plus, this doubles to up to 30% off for 24 hours on Miles Ð-Day on the 15th of every month Up to 15% off when you use your Discovery Miles to buy airtime, data, prepaid water, prepaid electricity or digital vouchers on the banking app Up to 15% off when you spend them on a range of exciting rewards in the Vitality Mall   You can also: Spend your Discovery Miles on flights, holiday accommodation and car hire Exchange your Discovery Miles for cash Or send them to your contacts with a Discovery Miles Account   Save more and pay less with Dynamic Interest Rates As a Discovery Bank client, you can control your interest rates with your Vitality Money status through Dynamic Interest Rates. With a Discovery Bank Black Card Account, you can get: Up to 2% interest on your positive balances in your everyday accounts. Up to 6.75% interest on demand savings accounts. Up to 5% less interest on your borrowing rate. Get an Apple Watch on us. Get a new Apple Watch from iStore with Discovery Bank and Vitality, and fund it in full by reaching your Vitality Active Rewards Exercise goals over 24 months. Access a world of unparalleled travel discounts in the most convenient way Vitality Travel is the first-of-its-kind, one-stop travel booking platform in South Africa that you get exclusive access to with Discovery Bank. Enjoy unprecedented discounts on a wide range of local and international flights, holiday accommodation, car hire and exciting travel experiences. Travel benefits and services     You can now book your discounted local and international flights in the Discovery Bank app - tap, tap, fly!     International cover for rental car collision damage     The ability to make purchases and cash withdrawals worldwide, wherever Visa is accepted     Free multi-trip international travel insurance with flight tickets purchased using your Discovery Bank Black cards. Up to  60% off local flights Get 10% to 60% off six one-way local flights with our partner airlines, plus an unlimited 10% off afterwards   Up to  50% off international flights Get 10% to 50% off two return regional or international bookings with our partner airlines, plus an unlimited 10% off afterwards Up to  25% off holiday accommodation and car hire Get 10% to 25% off unlimited local accommodation and car hire Plus, use Discovery Miles to pay for thousands of non-discounted local and international listings on Vitality Travel through Booking.com Up to  15% back on your next beach holiday, cruise or city adventure Get up to 15% cash back on Dream Destinations travel experiences with Contiki, Royal Caribbean International and World Leisure Holidays   Enjoy access to The Lounge, a partnership between Discovery Bank and SAA at OR Tambo, Cape Town and King Shaka International Airports. Get up to 12 domestic departure and up to 4 international departure visits a year for you and your guests. You'll also receive six visits a year to access over 1,200 airport lounges worldwide with LoungeKey. Plus, get faster security clearance with Discovery Bank Priority Fast Track at OR Tambo and Cape Town domestic departures, and spend even more time enjoying The Lounge! Improve your finances with Vitality Money When you join Discovery Bank, we help you review your financial health based on five key financial behaviours and you get a Vitality Money status based on this. Your Vitality Money status gives you a good indication of how well you are managing your finances. Not only that, but your Vitality Money status is also directly linked to what rewards you can earn. That's why we'll show you the steps to improve your status and give you access to tools like our Vitality Money Financial Analyser, which uses advanced analytics to give you intelligent insights and personalised alerts to help you become better with your money. As your Vitality Money status improves, so do your rewards. Get the only Real-Time Forex Accounts You can quickly and easily open our Discovery Bank Forex Accounts, available in British Pounds, Euros and US Dollars, 24/7 on the Discovery Bank app. Get real-time rates and immediately start saving and transacting in the foreign currency of your choice. Plus, you pay no fees when you transfer and convert between your foreign currency and Rand accounts, and we'll help you manage your foreign currency allowances too! Add your free virtual card on the banking app and link it to your smart device for fast on-the-go payments while you travel outside South Africa or order a physical debit card for cash withdrawals abroad. Open. Convert. Save. Pay. In seconds. What features to expect with your Discovery Bank Black Card Account An advanced and intuitive banking app     Add more or upgrade your accounts     Manage your cards, PINs and limits     Check your account balances     Track and improve your dynamic lifestyle rewards     View your Dynamic Interest Rates     Transfer funds between accounts     Manage and spend your Discovery Miles     Make international payments in over 60 currencies     Track foreign currency allowances     Set up beneficiaries     Set up debit orders     Increase credit limits     View and export transaction history     Use Smart Search to find transactions     Save important receipts and documents with Smart Vault     Make online payments and EFTs     Get immediate in-app help from a Discovery Banker with Live Assist     And much more! Comprehensive banking benefits     Get a credit card account with up to 55 days of interest-free purchases on select credit card transactions     Unlimited free Discovery Bank virtual cards to start using immediately after joining     Save and transact in US Dollars, British Pounds and Euros with your Real-Time Forex Accounts     Instantly settle medical co-payments at pharmacies like Clicks and Dis-Chem, hospitals and medical service providers with Health Pay     Make on-the-go payments with Apple Pay, Fitbit Pay, Garmin Pay, Google Pay, Samsung Pay and SwatchPAY!     Pay any of your contacts who are Discovery clients, using just their cellphone number     Withdraw cash at a till point at Checkers, Pick n Pay, Shoprite and selected Spar stores     Make deposits at Boxer, Checkers, Pick n Pay and Shoprite stores     Get free transaction notifications and monthly account statements     Choose from a range of unlimited, free savings account options, with personalised interest rates for large deposits     Access a range of Vitality Money tools to help you manage and improve your financial health     Real-time payments from as little as R1 using Discovery Instant Pay or PayShap to other South African banks, available 24/7. Enhanced security features     Advanced facial-recognition technology when logging in to the banking app     Discovery Bank Black cards use secure chip and PIN technology     Your card can make fast and secure tap-and-go payments     Secure tap-and-go payments with smart devices that support Apple Pay, Fitbit Pay, Garmin Pay, Google Pay, Samsung Pay and SwatchPAY!     Additional security with Verified by Visa and Visa Checkout for online purchases     Greater shopping convenience and security when shopping online with Discovery Bank virtual cards. A Discovery Miles Account     View, track, manage and spend your Discovery Miles     Generate vouchers for in-store payments     Purchase airtime, data, prepaid water, prepaid electricity or digital vouchers     Exchange your Discovery Miles for cash     Send Discovery Miles to your contacts. Free cover     Automatic warranty extension of up to 24 months and short-term protection against theft and accidental damage of purchases made with your Discovery Bank Black card through Visa. Banking fees for the Discovery Bank Black Card Account With a Discovery Bank Black Card Account you have a monthly fee of R235 that includes your monthly account fee, your Vitality Money premium, your single credit facility fee, and more. After that, you transact and only pay for what you use. For more details on your banking fees, please see the fees guide. Rewards are based on your engagement in Vitality programmes, Discovery products, and monthly qualifying card spend. Discovery Bank, Auth FSP. Limits, terms and conditions apply. "
},
{
  "_id": {
    "$oid": "6685aa95b1af5b73e43d37df"
  },
  "type": "plain_text",
  "content": " The Discovery Bank Platinum Card Account Qualifying income from R350,000 to R850,000 a year R155 per month Exceptional banking that puts you in control   The Discovery Bank Platinum Card Account is more than just a credit card. It offers comprehensive features, exclusive benefits, and lifestyle rewards. Your enhanced credit card has full transactional capabilities including the ability to set up third-party debit orders, make digital payments and accept salary deposits. Plus, get up to 55 days' interest-free credit on select transactions, and manage your credit easily with the most flexible credit facility in the market. You also get access to the only Real-Time Forex Accounts, available 24/7 on your banking app. Engage with our Vitality Money programme and unlock your personalised shared-value stack of lifestyle and travel rewards. You can get incredible flight savings and access to The Lounge in South Africa. And that's only the beginning. Get the account that rewards you for getting financially fit Discovery Bank rewards clients with Discovery Miles for getting healthier, driving well and spending responsibly. Discovery Miles is Discovery's rewards currency that's more versatile - and more valuable - than cash, with more ways to earn and spend them than ever before. Up to   50% back on healthy groceries at Pick n Pay or Woolworths with HealthyFood   Up to   50% back on personal care items at Clicks or Dis-Chem with HealthyCare, and on baby essentials at Babies R Us, Toys R Us or Dis-Chem Baby City with HealthyBaby Up to   15% back on fuel purchases at bp and select Shell service stations, and up to 15% back on Uber rides   Up to   3.5% back on Bank-Integrated Discovery Life plan premiums   You'll receive 10 Discovery Miles for every R1 reward you earn back. Earn base Discovery Miles on all qualifying credit card and multicurrency debit card purchases as you spend throughout the month. Plus, earn higher base Discovery Miles when you use a virtual card, depending on your Vitality Money status. Earn thousands of Discovery Miles every week on the new, personalised gameboard with Vitality Active Rewards Your goals Achieve your weekly Spend, Exercise or Drive goal to unlock Activity tiles of up to Ð1,000 Your products Unlock the Discovery tile of up to Ð750 based on how many Discovery products you have Your spend Spend at our grocery, pharmacy and fuel partners to unlock the Partner Spend tiles of up to Ð1,000 for the chance to earn your largest weekly transactions back Get up to 30% off when you spend your Discovery Miles: With a Discovery Bank Platinum Card Account, you could get up to 15% off when you spend your Discovery Miles throughout the month: Up to 15% off when you shop with your Discovery Miles at over 40 great online and in-store retail partners. Plus, this doubles to up to 30% off for 24 hours on Miles Ð-Day on the 15th of every month Up to 15% off when you use your Discovery Miles to buy airtime, data, prepaid water, prepaid electricity or digital vouchers on the banking app Up to 15% off when you spend them on a range of exciting rewards in the Vitality Mall   You can also: Spend your Discovery Miles on flights, holiday accommodation and car hire Exchange your Discovery Miles for cash Or send them to your contacts with a Discovery Miles Account   Save more and pay less with Dynamic Interest Rates As a Discovery Bank client, you can control your interest rates with your Vitality Money status through Dynamic Interest Rates. With a Discovery Bank Platinum Card Account, you can get: Up to 2% interest on your positive balances in your everyday accounts. Up to 6.75% interest on demand savings accounts. Up to 5% less interest on your borrowing rate. Get an Apple Watch on us Get a new Apple Watch from iStore with Discovery Bank and Vitality, and fund it in full by reaching your weekly Vitality Active Rewards Exercise goals over 24 months. Access a world of unparalleled travel discounts in the most convenient way Vitality Travel is the first-of-its-kind, one-stop travel booking platform in South Africa that you get exclusive access to with Discovery Bank. Enjoy unprecedented discounts on a wide range of local and international flights, holiday accommodation, car hire and exciting travel experiences. Travel benefits and services     You can now book your discounted local and international flights in the Discovery Bank app - tap, tap, fly!     Free international travel insurance with flight tickets purchased using your Discovery Bank Platinum cards     The ability to make purchases and cash withdrawals worldwide, wherever Visa is accepted. Up to  50% off local flights Get 10% to 50% off six one-way local flights with our partner airlines, plus an unlimited 10% off afterwards   Up to  35% off international flights Get 10% to 35% off two return regional or international bookings with our partner airlines, plus an unlimited 10% off afterwards Up to  25% off holiday accommodation and car hire Get 10% to 25% off unlimited local accommodation and car hire Plus, use Discovery Miles to pay for thousands of non-discounted local and international listings on Vitality Travel through Booking.com Up to  15% back on your next beach holiday, cruise or city adventure Get up to 15% cash back on Dream Destinations travel experiences with Contiki, Royal Caribbean International and World Leisure Holidays   Enjoy The Lounge, a partnership between Discovery Bank and SAA at OR Tambo, Cape Town and King Shaka International Airports. Get up to 2 domestic departure visits and an international departure visit a year. Improve your finances with Vitality Money When you join Discovery Bank, we help you review your financial health based on five key financial behaviours and you get a Vitality Money status based on this. Your Vitality Money status gives you a good indication of how well you are managing your finances. Not only that, but your Vitality Money status is also directly linked to what rewards you can earn. That's why we'll show you the steps to improve your status and give you access to tools like our Vitality Money Financial Analyser, which uses advanced analytics to give you intelligent insights and personalised alerts to help you become better with your money. As your Vitality Money status improves, so do your rewards. Get the only Real-Time Forex Accounts You can quickly and easily open our Discovery Bank Forex Accounts, available in British Pounds, Euros and US Dollars, 24/7 on the Discovery Bank app. Get real-time rates and immediately start saving and transacting in the foreign currency of your choice. Plus, you pay no fees when you transfer and convert between your foreign currency and Rand accounts, and we'll help you manage your foreign currency allowances too! Add your free virtual card on the banking app and link it to your smart device for fast on-the-go payments while you travel outside South Africa or order a physical debit card for cash withdrawals abroad. Open. Convert. Save. Pay. In seconds. What features to expect with your Discovery Bank Platinum Card Account An advanced and intuitive banking app     Add more or upgrade your accounts     Manage your cards, PINs and limits     Check your account balances     Track and improve your dynamic lifestyle rewards     View your Dynamic Interest Rates     Transfer funds between accounts     Manage and spend your Discovery Miles     Make international payments in over 60 currencies     Track foreign currency allowances     Set up beneficiaries     Set up debit orders     Increase credit limits     View and export transaction history     Save important receipts and documents with Smart Vault     Make online payments and EFTs     Get immediate in-app help from a Discovery Banker with Live Assist     And much more! Comprehensive banking benefits     Get a credit card account with up to 55 days of interest-free purchases on select credit card transactions     Unlimited free Discovery Bank virtual cards to start using immediately after joining     Save and transact in US Dollars, British Pounds and Euros with your Real-Time Forex Accounts     Instantly settle medical co-payments at pharmacies like Clicks and Dis-Chem, hospitals and medical service providers with Health Pay     Make on-the-go payments with Apple Pay, Fitbit Pay, Garmin Pay, Google Pay, Samsung Pay and SwatchPAY!     Pay any of your contacts who are Discovery clients, using just their cellphone number     Withdraw cash at a till point at Checkers, Pick n Pay, Shoprite and selected Spar stores     Make deposits at Boxer, Checkers, Pick n Pay and Shoprite stores     Get free transaction notifications and monthly account statements     Choose from a range of unlimited, free savings account options, with personalised interest rates for large deposits     Access a range of Vitality Money tools to help you manage and improve your financial health     Real-time payments from as little as R1 using Discovery Instant Pay or PayShap to other South African banks, available 24/7. Enhanced security features     Advanced facial-recognition technology when logging in to the banking app     Discovery Bank Platinum cards use secure chip and PIN technology     Your card can make fast and secure tap-and-go payments     Secure tap-and-go payments with smart devices that support Apple Pay, Fitbit Pay, Garmin Pay, Google Pay, Samsung Pay and SwatchPAY!     Additional security with Verified by Visa and Visa Checkout for online purchases     Greater shopping convenience and security when shopping online with Discovery Bank virtual cards. A Discovery Miles Account     View, track, manage and spend your Discovery Miles     Generate vouchers for in-store payments     Purchase airtime, data, prepaid water, prepaid electricity or digital vouchers     Exchange your Discovery Miles for cash     Send Discovery Miles to your contacts. Free cover     Automatic warranty extension of up to 24 months and short-term protection against theft and accidental damage of purchases made with your Discovery Bank Platinum card through Visa. Banking fees for the Discovery Bank Platinum Card Account With a Discovery Bank Platinum Card Account you have a monthly account fee of R155 that includes your monthly account fee, your Vitality Money premium, your single credit facility fee, and more. After that, you transact and only pay for what you use. For more details on your banking fees, please see the fees guide. Rewards are based on your engagement in Vitality programmes, Discovery products, and monthly qualifying card spend. Discovery Bank, Auth FSP. Limits, terms and conditions apply. "
},
{
  "_id": {
    "$oid": "6685abb6b1af5b73e43d37e2"
  },
  "type": "plain_text",
  "content": " The Discovery Bank Gold Card Account Qualifying income from R100,000 to R350,000 a year R100 per month Everyday banking with fantastic rewards   If you're looking for an account that's flexible, affordable and gives you more than just a credit card, then the Discovery Bank Gold Card Account is the smart choice for you. Plus, you can unlock fantastic value and rewards with your good banking behaviour. Why are we calling it more than just a credit card? Because you get a credit card with full transactional capabilities including the ability to set up third-party debit orders, make digital payments and accept salary deposits. You get up to 55 days' interest-free credit on select transactions, and you can manage your credit easily with the most flexible credit facility in the market. Plus, you can add as many free savings accounts as you need to achieve your goals. And you also get access to the only Real-Time Forex Accounts, available 24/7 on your banking app. Engage with our Vitality Money programme and unlock your personalised shared-value stack of lifestyle and travel rewards. You can get up to 40% back on HealthyFood and save up to 10% on fuel and Uber rides. And that's only the beginning. Get the account that rewards you for getting financially fit Discovery Bank rewards clients with Discovery Miles for getting healthier, driving well and spending responsibly. Discovery Miles is Discovery's rewards currency that's more versatile - and more valuable - than cash, with more ways to earn and spend them than ever before. With a Discovery Bank Gold Card Account you can earn the following rewards in Discovery Miles: Up to   40% back on healthy groceries at Pick n Pay or Woolworths with HealthyFood     Up to   10% back on fuel purchases at bp and select Shell service stations, and up to 10% back on Uber rides   Up to   2.5% back on Bank-Integrated Discovery Life plan premiums   You'll receive 10 Discovery Miles for every R1 reward you earn back. Earn base Discovery Miles on all qualifying credit card and multicurrency debit card purchases as you spend throughout the month. Plus, earn higher base Discovery Miles when you use a virtual card, depending on your Vitality Money status. Earn thousands of Discovery Miles every week on the new, personalised gameboard with Vitality Active Rewards Your goals Achieve your weekly Spend, Exercise or Drive goal to unlock Activity tiles of up to Ð1,000 Your products Unlock the Discovery tile of up to Ð750 based on how many Discovery products you have Your spend Spend at our grocery, pharmacy and fuel partners to unlock the Partner Spend tiles of up to Ð1,000 for the chance to earn your largest weekly transactions back Get up to 30% off when you spend your Discovery Miles: With a Discovery Bank Gold Card Account, you could get up to 15% off when you spend your Discovery Miles throughout the month: Up to 15% off when you shop with your Discovery Miles at over 40 great online and in-store retail partners. Plus, this doubles to up to 30% off for 24 hours on Miles Ð-Day on the 15th of every month Up to 15% off when you use your Discovery Miles to buy airtime, data, prepaid water, prepaid electricity or digital vouchers on the banking app Up to 15% off when you spend them on a range of exciting rewards in the Vitality Mall   You can also: Spend your Discovery Miles on flights, holiday accommodation and car hire Exchange your Discovery Miles for cash Or send them to your contacts with a Discovery Miles Account   Save more and pay less with Dynamic Interest Rates As a Discovery Bank client, you can control your interest rates with your Vitality Money status through Dynamic Interest Rates. With a Discovery Bank Gold Card Account, you can get: Up to 2% interest on your positive balances in your everyday accounts. Up to 6.75% interest on demand savings accounts. Up to 5% less interest on your borrowing rate. Get an Apple Watch on us. Get a new Apple Watch from iStore with Discovery Bank and Vitality, and fund it in full by reaching your Vitality Active Rewards Exercise goals over 24 months. Access a world of unparalleled travel discounts in the most convenient way Vitality Travel is the first-of-its-kind, one-stop travel booking platform in South Africa that you get exclusive access to with Discovery Bank. Enjoy unprecedented discounts on a wide range of local and international flights, holiday accommodation, car hire and exciting travel experiences. Travel benefits and services     You can now book your discounted local and international flights in the Discovery Bank app - tap, tap, fly!     Free international travel insurance with flight tickets purchased using your Discovery Bank Gold credit card     The ability to make purchases worldwide, wherever Visa is accepted. Up to  40% off local flights Get 10% to 40% off six one-way local flights with our partner airlines, plus an unlimited 10% off afterwards   Up to  35% off international flights Get 10% to 35% off two return regional or international bookings with our partner airlines, plus an unlimited 10% off afterwards Up to  25% off holiday accommodation and car hire Get 10% to 25% off unlimited local accommodation and car hire Plus, use Discovery Miles to pay for thousands of non-discounted local and international listings on Vitality Travel through Booking.com Up to  15% back on your next beach holiday, cruise or city adventure Get up to 15% cash back on Dream Destinations travel experiences with Contiki, Royal Caribbean International and World Leisure Holidays   Improve your finances with Vitality Money When you join Discovery Bank, we help you review your financial health based on five key financial behaviours and you get a Vitality Money status based on this. Your Vitality Money status gives you a good indication of how well you are managing your finances. Not only that, but your Vitality Money status is also directly linked to what rewards you can earn. That's why we'll show you the steps to improve your status and give you access to tools like our Vitality Money Financial Analyser, which uses advanced analytics to give you intelligent insights and personalised alerts to help you become better with your money. As your Vitality Money status improves, so do your rewards. Get the only Real-Time Forex Accounts You can quickly and easily open our Discovery Bank Forex Accounts, available in British Pounds, Euros and US Dollars, 24/7 on the Discovery Bank app. Get real-time rates and immediately start saving and transacting in the foreign currency of your choice. Plus, you pay no fees when you transfer and convert between your foreign currency and Rand accounts, and we'll help you manage your foreign currency allowances too! Add your free virtual card on the banking app and link it to your smart device for fast on-the-go payments while you travel outside South Africa or order a physical debit card for cash withdrawals abroad. Open. Convert. Save. Pay. In seconds. What features to expect with your Discovery Bank Gold Card Account An advanced and intuitive banking app     Add more or upgrade your accounts     Manage your cards, PINs and limits     Check your account balances     Track and improve your dynamic lifestyle rewards     View your Dynamic Interest Rates     Transfer funds between accounts     Manage and spend your Discovery Miles     Make international payments in over 60 currencies     Track foreign currency allowances     Set up beneficiaries     Set up debit orders     Increase credit limits     View and export transaction history     Use Smart Search to find transactions     Save important receipts and documents with Smart Vault     Make online payments and EFTs     Get immediate in-app help from a Discovery Banker with Live Assist     And much more! Comprehensive banking benefits     Get a credit card account with up to 55 days of interest-free purchases on select credit card transactions     Unlimited free Discovery Bank virtual cards to start using immediately after joining     Save and transact in US Dollars, British Pounds and Euros with your Real-Time Forex Accounts     Instantly settle medical co-payments at pharmacies like Clicks and Dis-Chem, hospitals and medical service providers with Health Pay     Make on-the-go payments with Apple Pay, Fitbit Pay, Garmin Pay, Google Pay, Samsung Pay and SwatchPAY!     Pay any of your contacts who are Discovery clients, using just their cellphone number     Withdraw cash at a till point at Checkers, Pick n Pay, Shoprite and selected Spar stores     Make deposits at Boxer, Checkers, Pick n Pay and Shoprite stores     Get free transaction notifications and monthly account statements     Choose from a range of unlimited, free savings account options, with personalised interest rates for large deposits     Access a range of Vitality Money tools to help you manage and improve your financial health.     Real-time payments from as little as R1 using Discovery Instant Pay or PayShap to other South African banks, available 24/7. Enhanced security features     Advanced facial-recognition technology when logging in to the banking app     Discovery Bank Gold cards use secure chip and PIN technology     Your card can make fast and secure tap-and-go payments     Secure tap-and-go payments with smart devices that support Apple Pay, Fitbit Pay, Garmin Pay, Google Pay, Samsung Pay and SwatchPAY!     Additional security with Verified by Visa and Visa Checkout for online purchases     Greater shopping convenience and security when shopping online with Discovery Bank virtual cards. A Discovery Miles Account     View, track, manage and spend your Discovery Miles     Generate vouchers for in-store payments     Purchase airtime, data, prepaid water, prepaid electricity or digital vouchers     Exchange your Discovery Miles for cash     Send Discovery Miles to your contacts. Banking fees for the Discovery Bank Gold Card Account With a Discovery Bank Gold Card Account you have a monthly fee of R100 that includes your monthly account fee, your Vitality Money premium, your single credit facility fee, and more. After that, you transact and only pay for what you use. For more details on your banking fees, please see the fees guide. Rewards are based on your engagement in Vitality programmes, Discovery products, and monthly qualifying card spend. Discovery Bank, Auth FSP. Limits, terms and conditions apply. "
},
{
  "_id": {
    "$oid": "66897c701013be7a001571a5"
  },
  "type": "plain_text",
  "content": "Name: James Joyce Income:     Monthly Income: R20,000   Yearly Income: R240,000 Currently has 15000 Vitality Points Other Sources: Sold a bike for R15,000 Accounts:     Account ID: 102     Account Type: Cheque     Opening Balance: R1,000     Current Balance: R1,500.50     Ending Balance: R1,500.50 Transactions:     15th Jan 2024: Spent R100 on groceries     10th Feb 2024: Deposited R500 (paycheck)     10th Feb 2024: Spent R150 on dinner     12th Feb 2024: Spent R50 at a party     15th Feb 2024: Spent R40 at a coffee shop     17th Feb 2024: Spent R40 at a coffee shop     18th Feb 2024: Spent R67 at a party     20th Feb 2024: Spent R67 at a party     24th Feb 2024: Spent R40 at a coffee shop     1st Mar 2024: Spent R25 on dinner     2nd Mar 2024: Spent R75 on BP petrol     3rd Mar 2024: Withdrew R200 from an ATM     10th Mar 2024: Refunded R150 for clothing     15th Mar 2024: Spent R100 at a birthday party     20th Mar 2024: Spent R150 at a dinner party     21st Mar 2024: Spent R200 at a party     31st Oct 2024: Spent R250 at a party Debts:     Credit Card Debt: R2,000     Interest Rate: 18.5%     Monthly Payment: R100     Due Date: 25th Jul 2024     Reminder: Credit card payment reminder on 20th Jul 2024 (pending) Savings:     Savings Goal: Holiday     Monthly Contribution: R200     Current Balance: R600     Target Date: 1st Dec 2025     Bank Options: Discovery Bank (1.5% interest),  Goals: Retirement by 1st Jan 2050 Expenses:     Category: Food     Amount: R200     Date: 1st Jul 2024  Budget: R300 Financial Planning:     Retirement Age: 65     Current Savings: R20,000     Projected Needs: R1,000,000     Major Purchases: Car (R30,000 by 1st Jan 2025)     Emergency Fund Goal: R10,000     Current Emergency Fund: R5,000 Payment Reminders:     Type: Debt Payment     Date: 20th Jul 2024     Message: Credit card payment due soon     Status: Pending Financial Indicators:     Debt-to-Income Ratio: 10% (ideal: 0-36%)     Savings-to-Income Ratio: 3% (ideal: 10-20%)     Saving Rate: 1% (ideal: 5-20%) InvestmentsInitial Investments:    S&P 500: $50,000    NVIDIA: $30,000Investment Performance:    June 2023:        S&P 500: $50,000        NVIDIA: $30,000    July 2023:        S&P 500: $51,000        NVIDIA: $31,000    August 2023:        S&P 500: $52,000        NVIDIA: $30,500    September 2023:        S&P 500: $53,000        NVIDIA: $32,000    October 2023:        S&P 500: $54,000        NVIDIA: $31,500    November 2023:        S&P 500: $55,000        NVIDIA: $32,500    December 2023:        S&P 500: $56,000        NVIDIA: $31,000    January 2024:        S&P 500: $57,000        NVIDIA: $33,000    February 2024:        S&P 500: $58,000        NVIDIA: $32,000    March 2024:        S&P 500: $59,000        NVIDIA: $34,000    April 2024:        S&P 500: $60,000        NVIDIA: $33,500    May 2024:        S&P 500: $61,000        NVIDIA: $34,500    June 2024:        S&P 500: $62,000        NVIDIA: $50,000    July 2024:        S&P 500: $63,000        NVIDIA: $52,000\"\n"
},
{
  "_id": {
    "$oid": "668eaa959afa1dc7d8349823"
  },
  "name": "James Joyce",
  "email": "Jamesjoyce123@gmail.com",
  "type": "investments",
  "initial_investments": {
    "S&P 500": 50000,
    "NVIDIA": 30000
  },
  "investment_performance": [
    {
      "month": "2023-06",
      "S&P 500": 50000,
      "NVIDIA": 30000
    },
    {
      "month": "2023-07",
      "S&P 500": 51000,
      "NVIDIA": 31000
    },
    {
      "month": "2023-08",
      "S&P 500": 52000,
      "NVIDIA": 30500
    },
    {
      "month": "2023-09",
      "S&P 500": 53000,
      "NVIDIA": 32000
    },
    {
      "month": "2023-10",
      "S&P 500": 54000,
      "NVIDIA": 31500
    },
    {
      "month": "2023-11",
      "S&P 500": 55000,
      "NVIDIA": 32500
    },
    {
      "month": "2023-12",
      "S&P 500": 56000,
      "NVIDIA": 31000
    },
    {
      "month": "2024-01",
      "S&P 500": 57000,
      "NVIDIA": 33000
    },
    {
      "month": "2024-02",
      "S&P 500": 58000,
      "NVIDIA": 32000
    },
    {
      "month": "2024-03",
      "S&P 500": 59000,
      "NVIDIA": 34000
    },
    {
      "month": "2024-04",
      "S&P 500": 60000,
      "NVIDIA": 33500
    },
    {
      "month": "2024-05",
      "S&P 500": 61000,
      "NVIDIA": 34500
    },
    {
      "month": "2024-06",
      "S&P 500": 62000,
      "NVIDIA": 50000
    },
    {
      "month": "2024-07",
      "S&P 500": 63000,
      "NVIDIA": 52000
    }
  ]
},
{
  "_id": {
    "$oid": "668eaa959afa1dc7d8349822"
  },
  "name": "James Joyce",
  "email": "Jamesjoyce123@gmail.com",
  "type": "transactions",
  "opening_amount": 20000,
  "monthly_income": 20000,
  "transactions": [
    {
      "type": "expense",
      "category": "nightclub",
      "amount": 500,
      "date": {
        "$date": "2024-07-01T00:00:00.000Z"
      }
    },
    {
      "type": "expense",
      "category": "nightclub",
      "amount": 700,
      "date": {
        "$date": "2024-07-15T00:00:00.000Z"
      }
    },
    {
      "type": "expense",
      "category": "nightclub",
      "amount": 600,
      "date": {
        "$date": "2024-07-29T00:00:00.000Z"
      }
    },
    {
      "type": "expense",
      "category": "grocery",
      "amount": 200,
      "date": {
        "$date": "2024-07-02T00:00:00.000Z"
      }
    },
    {
      "type": "expense",
      "category": "transport",
      "amount": 100,
      "date": {
        "$date": "2024-07-05T00:00:00.000Z"
      }
    },
    {
      "type": "expense",
      "category": "restaurant",
      "amount": 150,
      "date": {
        "$date": "2024-07-08T00:00:00.000Z"
      }
    },
    {
      "type": "expense",
      "category": "utilities",
      "amount": 300,
      "date": {
        "$date": "2024-07-10T00:00:00.000Z"
      }
    },
    {
      "type": "expense",
      "category": "shopping",
      "amount": 400,
      "date": {
        "$date": "2024-07-12T00:00:00.000Z"
      }
    },
    {
      "type": "expense",
      "category": "entertainment",
      "amount": 250,
      "date": {
        "$date": "2024-07-20T00:00:00.000Z"
      }
    },
    {
      "type": "expense",
      "category": "medical",
      "amount": 350,
      "date": {
        "$date": "2024-07-25T00:00:00.000Z"
      }
    }
  ],
  "closing_balance": 17850
},
{
  "_id": {
    "$oid": "669786815ec65dbbdb44d901"
  },
  "type": "plain-text",
  "content": "James Joyce has 15000 points.Vitality Status Levels    Blue Status:        Entry-level status, no points required.    Bronze Status:        Requires 10,000 points.    Silver Status:        Requires 25,000 points.    Gold Status:        Requires 45,000 points.    Diamond Status:        Requires 60,000 points.Rewards Here’s an idea of the kinds of rewards and the points you might need to unlock them:    Travel Discounts:        Flights, accommodation, and car rental discounts are available at Silver or Gold status.    Fitness Devices:        Discounts on devices like Garmin, Fitbit, and Apple Watch are available at various status levels, with greater discounts at higher statuses.    Healthy Food Cashback:        Available at any status, with the percentage of cashback increasing with higher statuses.    Movie Tickets:        Free or discounted tickets are available to members who reach weekly fitness goals.    Weekly Active Rewards:        Achieving personalized weekly fitness goals can earn you vouchers for coffee, smoothies, and more.    Vitality Active Rewards:        Reaching weekly targets can earn rewards such as discounted or free smoothies, coffees, and more.The Discovery Vitality program offers a wide range of activities to earn points, and the rewards and discounts increase as your status level improves. By staying active, undergoing regular health check-ups, and making healthy lifestyle choices, you can earn points to unlock various benefits and rewards. For the most accurate and up-to-date information, always refer to the official Discovery Vitality documentation or contact their support."
}]